#include <stdio.h>

void main()
{
	// 1. 将有符合赋值给无符号
	int i = -1;
	unsigned u_i; // 不需要定义变量的数据类型 
	u_i = i;
	printf("u_i=%u -- 0x%x\n",u_i); 	// 4294967295 
	// 电脑保存负数是以补码的形式保存 
	// 1000 0000 0000 0000 0000 0000 0000 0001	// 说简单一些就是先减一然后按位取反 
	// 1111 1111 1111 1111 1111 1111 1111 1111 
	// 1111 1111 1111 1111 1111 1111 1111 1111 
	// 无符号位应该不能直接使用%x格式化显示 
	
	// 2. 将无符号赋值给有符号变量
	unsigned u_i_2 = 4294967295UL;
	int i_2 = u_i_2;
	int i_3 = -1;
	printf("%d -- %x\n",i_2);
	printf("%x\n",i_3); 
	
	// 3. 较复杂的输入输出格式化
	/* 
	%md
	%ld
	%o
	%x
	%u
	%mc
	%ms	// 字符串长度小于m的时候, 再左侧补足空格 
	%-ms	// 字符串长度小于m的时候, 字符串向左靠齐, 在右侧补足空格 
	%m.ns  //	m < n的时候, m会自动扩展到n 
	%-m.ns // 
	%m.nf  // 输出的字符至少是m列, 保留n个小数点, 不足m列的从左端开始补空格 
	%-m.nf // 同上, 只不过补空格是从右侧开始补
	%m.ne 指数表达式 
	%-m.ne 
	%g		// 自由从%f和%e中选择列数小的表达式, 并省略掉输出无意义的数字 
	 // 假如想输出%号, printf("%%");即可 
	 */
	char *china = "china";
	printf("%03c\n",'a');	
	printf("%08s\n",china);			
	printf("%-08s\n",china);    
	printf("%08.2s\n",china);   
	printf("%-08.2s\n",china);
	printf("%3.4s\n",china); 	// chin
	printf("%3.6s\n",china); 	// china
	/*
  a				// 前面补了两个空格 
   china		// 前面补了3个空格,  
china			// 在后面补了3个空格 
      ch		// 截取了从左开始的2个字符, 左侧补6个空格 
ch				// 截取了从左开始的2个字符, 右侧补6个空格 
	*/   
	printf("------------------------\n");
	float f = 123.456;
	printf("%f  %10f  %10.2f  %.2f  % 10.2f\n",f,f,f,f,f); 
	// 123.456001--123.456001--    123.46--123.46--123.46
	// %f, 默认整数部分全部显示, 小数部分显示6位, 并且从左到右有效位7位, 其他位无意义
	// %10f,  
	printf("输出百分号: %%"); 
}                        
