#include  <stdio.h>	// <stdio.h>, 在系统库中查找, "stdio.h", 在本地工程先查找, 找不到再到系统中查找 

void main()
{
	// 输出格式化语句
	/*
		%f	// 输出float, double都可以, 输出的时候可以指定长度, 也可以由系统自己决定保留的长度
			练习:
				1. 指定长度
				2. 输出由系统自动决定长度的实数, 整数部分全部输出, 小数部分输出6位,  
	*/ 
	float f = 123.456434664;
	float f1 = 321.10; 
	printf("%f\n",f); 			// 123.456436
	printf("%f\n",f1);			// 321.100006, 小数部分输出的并不一定是实数本身, 
	
	// demo2
	printf("-------------------------------\n");
	float f2 = 222222.2222;
	float f3 = 333333.3333;
	printf("%f\n",f2+f3); // 555555.562500, 有效数字是7位, 555555.5 62500, 前半部分是有效位,后部分无意义
						// 如果想要高精度, 考虑使用double
	printf("%20f\n",f2+f3); // 指定长度只能是只有3位, 却想显示10位的情况生效 
	printf("------------------------------\n");
	float f4 = 22222222;
	float f5 = 33333333;
	printf("%f\n",f4+f5);		// 55555552.000000, 数据丢失 
	
	printf("------------------------------\n");
	float f6 = 123.456;
	printf("%e\n",f6); 		// 1.234560e+002
	printf("------------------------------\n");
	float f7 = 654.321;		// 6.543210E+002
	printf("%E\n",f7); 
	printf("------------------------------\n");
	int a,b,c;
	scanf("%d,%d,%d",&a,&b,&c);
	printf("a=%d,b=%d,c=%d",a,b,c); 
	/*
		4,5,6	-> 输入必须要和%d,%d,%d中的分隔符匹配,  
		a=4,b=5,c=6
		
		如果输入的是 
	*/
	printf("-------------------------------\n");
	int d;
	char e;
	float f8;
	scanf("%d%c%f",&d,&e,&f8);
	printf("d=%d,e=%c,f8=%f",d,e,f8); 
	/*
		12k23o.4
		d=12,e=k,f8=23.000000
		12   k   23     o.4		// o.4匹配不上被丢弃了 
		d=12,e=k,f8=23.000000
	*/
}
